Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
stamp" = "1758162475034048000" -> "1758249688131433000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6592979008540355956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473252952000" -> "1758249688309326800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6762945615508699709" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162475883606000" -> "1758249688220710000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8134017008859075160" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473526038000" -> "1758249688602089000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17" -> (known after apply)
      ~ code_sha256                 = "EriNZ8gDvoLMY0wLcVrPglwJ+I3nwRQWp5fGCP2Hvzk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T02:30:58.720+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 37631 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 19633dac) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> null
      - code_sha256                 = "Amq1IkgWmJL5tXM4aJTntQZPjhOTezvOThv/P3TJF6A=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:21.106+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> null
      - layer_name                  = "svep_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "svep-backend-layers-20250815040234005900000003" -> null
      - s3_key                      = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 37622 -> null
      - version                     = "16" -> null
        # (5 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "6f230860e35b8d23cd42ba28fe1ee483" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250815040234005900000003/builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> (known after apply)
      ~ key                           = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 4dfa7b5a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - bucket                        = "svep-backend-layers-20250815040234005900000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "e77c0b610e9db1644fc3da17c0f11a3b" -> null
      - force_destroy                 = false -> null
      - id                            = "svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - key                           = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8178332493341543627" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0ad51721cb783e3e13a9c91bc038388b42de8d95f791de65494e4b83bb01e67a.zip" -> "builds/a995e7371b142bbfbe51cd7aaffc53348de548c6db5f85e5d8fe9c23ff53db83.zip"
          ~ "timestamp" = "1758162473963816000" -> "1758249688213008000"
        }
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] (deposed object 6b39be94) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1762326486056651827" -> null
      - triggers = {
          - "filename"  = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip"
          - "timestamp" = "1756111471821086000"
        } -> null
    }

Plan: 77 to add, 46 to change, 108 to destroy.
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=67ff60209ff88fe2f4a4c5cf34cc564544dbfc4f]
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=21804c139b4bfe44841ed7f7985679eb96eb122f]
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creation complete after 0s [id=b6eac0e2635fb6a0b81861938d03381bca4bf053]
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=adfe1bc283319e9631ba9cd9b0451188c411b138]
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creation complete after 0s [id=3ff50416bcba152bc7b841550a28a353089194d6]
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=d2aab46ada6ea30b203db940011ab2bb52a5a4f3]
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creation complete after 0s [id=118ace42626d06f38556b5e164ffee9b9541471c]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' archive
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-x0t5jndm
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-x0t5jndm
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 0s [id=4650116208415551745]
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 0s [id=1027834277928431944]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 0s [id=256572064713164027]
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip' archive
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/getResultsURL
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: creating 'builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/splitQuery
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/pluginGnomadConstraint
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): Created: builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-a8qobtn5
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-a8qobtn5
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creation complete after 1s [id=5258646634713273200]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 1s [id=5579630853446564914]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=4498729018185921697]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip' archive
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/performQuery
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_builder.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_engine.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Created: builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=e627386c13fb03752809af5946101c4068e83fc4]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creation complete after 1s [id=4915364255219876423]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=b203721c19efde72c9ee665e6c6ed51d10587d87]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: creating 'builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created: builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 1s [id=3733774528326553922]
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/batchStarter
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=9069470021240311737]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: creating 'builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip' archive
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/clearTempAndRegions
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Created: builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 1s [id=4476735526647824885]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creation complete after 0s [id=382245549494451869]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created: builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 0s [id=3555299184969919713]
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 0s [id=6978911762320206619]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: constraints.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: mirna.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 0s [id=8597651515416974515]
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=5414602799817758892]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: creating 'builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip' archive
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/deleteClinicalWorkflow
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): Created: builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 1s [id=8478302736043651006]
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creation complete after 1s [id=6603464723893759194]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip' archive
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/initQuery
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created: builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creation complete after 1s [id=279420487806570984]
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 1s [id=7903114538572477559]
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip' archive
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=7478213447212109489]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: creating 'builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip' archive
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/concatPages
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Created: builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip' archive
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/concatStarter
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Created: builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creation complete after 0s [id=7586718031411934196]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creation complete after 0s [id=1069987485273622304]
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: creating 'builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/createPages
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created: builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: creating 'builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip' archive
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/concat
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Created: builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 0s [id=1403011275793836632]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creation complete after 0s [id=1734754023498512585]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip' archive
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/qcNotes
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip' archive
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/batchSubmit
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: creating 'builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip' archive
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created: builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 0s [id=3388479997595603307]
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 0s [id=4687967804849050175]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 0s [id=6602482484474837763]
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 1s [id=2343769833031461156]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip' archive
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/pluginGnomad
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Created: builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creation complete after 1s [id=5697528667347327376]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: creating 'builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/svep/lambda/queryVCF
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Created: builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].aws_lambda_layer_version.binaries_layer: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creation complete after 1s [id=7879947072375832803]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 1s [id=4487962623229225545]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip' archive
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 1s [id=7100243794917045777]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 0s [id=227955413556878701]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 1s [id=7414289866617798995]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 0s [id=9129474084643091827]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: creating 'builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/278/default/sbeacon/lambda/getGenomicVariants
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_bio
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.